; domain
(define (domain scanalyzer3d)
  (:requirements :typing :action-costs)
  (:types segment car - object)
  (:predicates (on ?c - car ?s - segment)
	       (analyzed ?c - car)
	       (CYCLE-2 ?s1 ?s2 - segment)
	       (CYCLE-4 ?s1 ?s2 ?s3 ?s4 - segment)
	       (CYCLE-2-WITH-ANALYSIS ?s1 ?s2 - segment)
	       (CYCLE-4-WITH-ANALYSIS ?s1 ?s2 ?s3 ?s4 - segment))
  (:functions (total-cost) - number)

  (:action analyze-2
   :parameters (?s1 ?s2 - segment ?c1 ?c2 - car)
   :precondition (and (CYCLE-2-WITH-ANALYSIS ?s1 ?s2)
		      (on ?c1 ?s1)
		      (on ?c2 ?s2)
		  )
   :effect (and (not (on ?c1 ?s1))
		(not (on ?c2 ?s2))
		(on ?c1 ?s2)
		(on ?c2 ?s1)
		(analyzed ?c1)
		(increase (total-cost) 3)
	   )
   )

  (:action analyze-4
   :parameters (?s1 ?s2 ?s3 ?s4 - segment ?c1 ?c2 ?c3 ?c4 - car)
   :precondition (and (CYCLE-4-WITH-ANALYSIS ?s1 ?s2 ?s3 ?s4)
		      (on ?c1 ?s1)
		      (on ?c2 ?s2)
		      (on ?c3 ?s3)
		      (on ?c4 ?s4)
		  )
   :effect (and (not (on ?c1 ?s1))
		(not (on ?c2 ?s2))
		(not (on ?c3 ?s3))
		(not (on ?c4 ?s4))
		(on ?c1 ?s4)
		(on ?c2 ?s1)
		(on ?c3 ?s2)
		(on ?c4 ?s3)
		(analyzed ?c1)
		(increase (total-cost) 3)
	   )
   )
	       
  (:action rotate-2
   :parameters (?s1 ?s2 - segment ?c1 ?c2 - car)
   :precondition (and (CYCLE-2 ?s1 ?s2)
		      (on ?c1 ?s1)
		      (on ?c2 ?s2)
		  )
   :effect (and (not (on ?c1 ?s1))
		(not (on ?c2 ?s2))
		(on ?c1 ?s2)
		(on ?c2 ?s1)
		(increase (total-cost) 1)
	   )
  )

  (:action rotate-4
   :parameters (?s1 ?s2 ?s3 ?s4 - segment ?c1 ?c2 ?c3 ?c4 - car)
   :precondition (and (CYCLE-4 ?s1 ?s2 ?s3 ?s4)
		      (on ?c1 ?s1)
		      (on ?c2 ?s2)
		      (on ?c3 ?s3)
		      (on ?c4 ?s4)
		  )
   :effect (and (not (on ?c1 ?s1))
		(not (on ?c2 ?s2))
		(not (on ?c3 ?s3))
		(not (on ?c4 ?s4))
		(on ?c1 ?s4)
		(on ?c2 ?s1)
		(on ?c3 ?s2)
		(on ?c4 ?s3)
		(increase (total-cost) 1)
	   )
   )
)


;; different costs for analyze and swap?

; problem
(define (problem scanalyzer3d-2-ab-in)
  (:domain scanalyzer3d)
  (:objects
    car-in-1a - car
    car-in-1b - car
    car-in-2a - car
    car-in-2b - car
    car-out-1a - car
    car-out-1b - car
    car-out-2a - car
    car-out-2b - car
    seg-in-1a - segment
    seg-in-1b - segment
    seg-in-2a - segment
    seg-in-2b - segment
    seg-out-1a - segment
    seg-out-1b - segment
    seg-out-2a - segment
    seg-out-2b - segment
  )
  (:init
    (= (total-cost) 0)
    (CYCLE-4 seg-in-1a seg-in-1b seg-out-1a seg-out-1b)
    (CYCLE-4 seg-in-1a seg-in-1b seg-out-2a seg-out-2b)
    (CYCLE-4 seg-in-2a seg-in-2b seg-out-1a seg-out-1b)
    (CYCLE-4 seg-in-2a seg-in-2b seg-out-2a seg-out-2b)
    (CYCLE-4-WITH-ANALYSIS seg-in-1a seg-in-1b seg-out-1a seg-out-1b)
    (CYCLE-4-WITH-ANALYSIS seg-in-2a seg-in-2b seg-out-1a seg-out-1b)
    (on car-in-1a seg-in-1a)
    (on car-in-1b seg-in-1b)
    (on car-in-2a seg-in-2a)
    (on car-in-2b seg-in-2b)
    (on car-out-1a seg-out-1a)
    (on car-out-1b seg-out-1b)
    (on car-out-2a seg-out-2a)
    (on car-out-2b seg-out-2b)
  )
  (:goal (and
    (analyzed car-in-1a)
    (analyzed car-in-1b)
    (analyzed car-in-2a)
    (analyzed car-in-2b)
    (analyzed car-out-1a)
    (analyzed car-out-1b)
    (analyzed car-out-2a)
    (analyzed car-out-2b)
    (on car-in-1a seg-out-1b)
    (on car-in-1b seg-in-1a)
    (on car-in-2a seg-out-2b)
    (on car-in-2b seg-in-2a)
    (on car-out-1a seg-in-1b)
    (on car-out-1b seg-out-1a)
    (on car-out-2a seg-in-2b)
    (on car-out-2b seg-out-2a)
  ))
  (:metric minimize (total-cost))
)

; plan
1. (analyze-4 seg-in-2a seg-in-2b seg-out-1a seg-out-1b car-in-2a car-in-2b car-out-1a car-out-1b)
   deleted: (on car-in-2a seg-in-2a) (on car-in-2b seg-in-2b) (on car-out-1a seg-out-1a) (on car-out-1b seg-out-1b)
   added: (on car-in-2a seg-out-1b) (on car-in-2b seg-in-2a) (on car-out-1a seg-in-2b) (on car-out-1b seg-out-1a) (analyzed car-in-2a)
   goals met: 3 of 16
2. (analyze-4 seg-in-2a seg-in-2b seg-out-1a seg-out-1b car-in-2b car-out-1a car-out-1b car-in-2a)
   deleted: (on car-in-2b seg-in-2a) (on car-out-1a seg-in-2b) (on car-out-1b seg-out-1a) (on car-in-2a seg-out-1b)
   added: (on car-in-2b seg-out-1b) (on car-out-1a seg-in-2a) (on car-out-1b seg-in-2b) (on car-in-2a seg-out-1a) (analyzed car-in-2b)
   goals met: 2 of 16
3. (rotate-4 seg-in-2a seg-in-2b seg-out-2a seg-out-2b car-out-1a car-out-1b car-out-2a car-out-2b)
   deleted: (on car-out-1a seg-in-2a) (on car-out-1b seg-in-2b) (on car-out-2a seg-out-2a) (on car-out-2b seg-out-2b)
   added: (on car-out-1a seg-out-2b) (on car-out-1b seg-in-2a) (on car-out-2a seg-in-2b) (on car-out-2b seg-out-2a)
   goals met: 4 of 16
4. (rotate-4 seg-in-2a seg-in-2b seg-out-2a seg-out-2b car-out-1b car-out-2a car-out-2b car-out-1a)
   deleted: (on car-out-1b seg-in-2a) (on car-out-2a seg-in-2b) (on car-out-2b seg-out-2a) (on car-out-1a seg-out-2b)
   added: (on car-out-1b seg-out-2b) (on car-out-2a seg-in-2a) (on car-out-2b seg-in-2b) (on car-out-1a seg-out-2a)
   goals met: 2 of 16
5. (analyze-4 seg-in-2a seg-in-2b seg-out-1a seg-out-1b car-out-2a car-out-2b car-in-2a car-in-2b)
   deleted: (on car-out-2a seg-in-2a) (on car-out-2b seg-in-2b) (on car-in-2a seg-out-1a) (on car-in-2b seg-out-1b)
   added: (on car-out-2a seg-out-1b) (on car-out-2b seg-in-2a) (on car-in-2a seg-in-2b) (on car-in-2b seg-out-1a) (analyzed car-out-2a)
   goals met: 3 of 16
6. (analyze-4 seg-in-2a seg-in-2b seg-out-1a seg-out-1b car-out-2b car-in-2a car-in-2b car-out-2a)
   deleted: (on car-out-2b seg-in-2a) (on car-in-2a seg-in-2b) (on car-in-2b seg-out-1a) (on car-out-2a seg-out-1b)
   added: (on car-out-2b seg-out-1b) (on car-in-2a seg-in-2a) (on car-in-2b seg-in-2b) (on car-out-2a seg-out-1a) (analyzed car-out-2b)
   goals met: 4 of 16
7. (analyze-4 seg-in-1a seg-in-1b seg-out-1a seg-out-1b car-in-1a car-in-1b car-out-2a car-out-2b)
   deleted: (on car-in-1a seg-in-1a) (on car-in-1b seg-in-1b) (on car-out-2a seg-out-1a) (on car-out-2b seg-out-1b)
   added: (on car-in-1a seg-out-1b) (on car-in-1b seg-in-1a) (on car-out-2a seg-in-1b) (on car-out-2b seg-out-1a) (analyzed car-in-1a)
   goals met: 7 of 16
8. (analyze-4 seg-in-1a seg-in-1b seg-out-1a seg-out-1b car-in-1b car-out-2a car-out-2b car-in-1a)
   deleted: (on car-in-1b seg-in-1a) (on car-out-2a seg-in-1b) (on car-out-2b seg-out-1a) (on car-in-1a seg-out-1b)
   added: (on car-in-1b seg-out-1b) (on car-out-2a seg-in-1a) (on car-out-2b seg-in-1b) (on car-in-1a seg-out-1a) (analyzed car-in-1b)
   goals met: 6 of 16
9. (rotate-4 seg-in-1a seg-in-1b seg-out-2a seg-out-2b car-out-2a car-out-2b car-out-1a car-out-1b)
   deleted: (on car-out-2a seg-in-1a) (on car-out-2b seg-in-1b) (on car-out-1a seg-out-2a) (on car-out-1b seg-out-2b)
   added: (on car-out-2a seg-out-2b) (on car-out-2b seg-in-1a) (on car-out-1a seg-in-1b) (on car-out-1b seg-out-2a)
   goals met: 7 of 16
10. (rotate-4 seg-in-1a seg-in-1b seg-out-2a seg-out-2b car-out-2b car-out-1a car-out-1b car-out-2a)
   deleted: (on car-out-2b seg-in-1a) (on car-out-1a seg-in-1b) (on car-out-1b seg-out-2a) (on car-out-2a seg-out-2b)
   added: (on car-out-2b seg-out-2b) (on car-out-1a seg-in-1a) (on car-out-1b seg-in-1b) (on car-out-2a seg-out-2a)
   goals met: 6 of 16
11. (analyze-4 seg-in-1a seg-in-1b seg-out-1a seg-out-1b car-out-1a car-out-1b car-in-1a car-in-1b)
   deleted: (on car-out-1a seg-in-1a) (on car-out-1b seg-in-1b) (on car-in-1a seg-out-1a) (on car-in-1b seg-out-1b)
   added: (on car-out-1a seg-out-1b) (on car-out-1b seg-in-1a) (on car-in-1a seg-in-1b) (on car-in-1b seg-out-1a) (analyzed car-out-1a)
   goals met: 7 of 16
12. (analyze-4 seg-in-1a seg-in-1b seg-out-1a seg-out-1b car-out-1b car-in-1a car-in-1b car-out-1a)
   deleted: (on car-out-1b seg-in-1a) (on car-in-1a seg-in-1b) (on car-in-1b seg-out-1a) (on car-out-1a seg-out-1b)
   added: (on car-out-1b seg-out-1b) (on car-in-1a seg-in-1a) (on car-in-1b seg-in-1b) (on car-out-1a seg-out-1a) (analyzed car-out-1b)
   goals met: 8 of 16
13. (analyze-4 seg-in-1a seg-in-1b seg-out-1a seg-out-1b car-in-1a car-in-1b car-out-1a car-out-1b)
   deleted: (on car-in-1a seg-in-1a) (on car-in-1b seg-in-1b) (on car-out-1a seg-out-1a) (on car-out-1b seg-out-1b)
   added: (on car-in-1a seg-out-1b) (on car-in-1b seg-in-1a) (on car-out-1a seg-in-1b) (on car-out-1b seg-out-1a)
   goals met: 12 of 16
14. (rotate-4 seg-in-2a seg-in-2b seg-out-2a seg-out-2b car-in-2a car-in-2b car-out-2a car-out-2b)
   deleted: (on car-in-2a seg-in-2a) (on car-in-2b seg-in-2b) (on car-out-2a seg-out-2a) (on car-out-2b seg-out-2b)
   added: (on car-in-2a seg-out-2b) (on car-in-2b seg-in-2a) (on car-out-2a seg-in-2b) (on car-out-2b seg-out-2a)
   goals met: 16 of 16
